"""Напишите функцию, которая отображает на экран
форматированный текст, указанный ниже:
“Don't compare yourself with anyone in this world…
if you do so, you are insulting yourself.”
Bill Gates"""


def text():
    quote = "Don't compare yourself with anyone in this world...\nif you do so, you are insulting yourself."
    author = "Bill Gates"
    print(f"{quote}\n— {author}")

text()
